summer20100514/NRF52_Make_Progress/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static bool setting_timer_fired(void)
{
    bool fired = false;
    CRITICAL_REGION_ENTER();
    fired = setting_timer_expired;
    setting_timer_expired = false;
    CRITICAL_REGION_EXIT();

    return fired;
}

static void setting_timer_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    // NRF_LOG_RAW_INFO("!\r\n");
    setting_timer_expired = true;
}

static void setting_timer_init(void)
{
    ret_code_t err_code;
    err_code = app_timer_create(&m_setting_timer_id,
                            APP_TIMER_MODE_SINGLE_SHOT,
                            setting_timer_handler);
    APP_ERROR_CHECK(err_code);
}

static void setting_timer_restart(uint32_t timeout_ticks)
{
    app_timer_stop(m_setting_timer_id);
    app_timer_start(m_setting_timer_id, timeout_ticks, NULL);
}

static void setting_timer_stop(void)
{
    app_timer_stop(m_setting_timer_id);
    (void)setting_timer_fired();
}

#if defined(ENABLE_DEBUG_PIN)
static void debug_pin_init(void)
{
    nrf_gpio_cfg_output(DEBUG_PIN);
    nrf_gpio_pin_write(DEBUG_PIN, 0);
}
#endif

#define SETTING_TIMER_TIMEOUT   3000
#define TIME_CHANGE_STEP        5
/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    uint16_t cur_mins = 0, set_mins = 0;
    uint32_t start_time = 0, elapsed_time = 0, cur_time = 0, last_time = 0;
    int key_value, rotary_state;

    // Initialize.
    log_init();
    timers_init();
    // buttons_leds_init(&erase_bonds);
#if defined(ENABLE_DEBUG_PIN)
    debug_pin_init();
#endif
    rotary_encoder_init();
    spi_and_gpio_init();
    time_timer_init();
    fsm_timer_init();
    trigger_loop_timer_init();
    setting_timer_init();
    epd_display_init();

    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("compiled at %s %s", __DATE__, __TIME__);
    application_timers_start();
    advertising_start(erase_bonds);
    // enable dcdc to save power
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);

    while (show_progress_hm_time_with_power_down(90, 90) != fsm_rt_cpl);
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();

#if defined(ENABLE_DEBUG_PIN)
//        DEBUG_POINT_A(); // to see the system duty cycle
#endif
        key_value = get_key_value();
        rotary_state = get_rotary_encoder_state();
        if (key_value != KEY_UNPRESSED) {
            NRF_LOG_RAW_INFO("key: %d\r\n", key_value);
        }
        if (rotary_state != ROTARY_STATE_INVALID) {
            NRF_LOG_RAW_INFO("rotary: %d\r\n", rotary_state);
        }

        static enum {
            MAIN_APP_START = 0,
            MAIN_APP_WAIT_LONG_PRESS,
            MAIN_APP_RESET_AND_SET_TIME,
            MAIN_APP_WAIT_SHORT_PRESS,
            MAIN_APP_SHOW_EXAMPLE,
            MAIN_APP_CHECK_TIME,
            MAIN_APP_UPDATE_PROGRESS
        } s_tState = MAIN_APP_START;

        switch (s_tState) {
            case MAIN_APP_START:
                s_tState = MAIN_APP_WAIT_LONG_PRESS;
                // break;
            case MAIN_APP_WAIT_LONG_PRESS:
                if (key_value == KEY_PRESSED_LONG) {
                    trigger_loop_timer(); // for low power wakeup
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_RESET_AND_SET_TIME\r\n");
                    s_tState = MAIN_APP_RESET_AND_SET_TIME;
                }
                break;
            case MAIN_APP_RESET_AND_SET_TIME:
                if (show_settings_screen() == fsm_rt_cpl) {
                    setting_timer_restart(APP_TIMER_TICKS(SETTING_TIMER_TIMEOUT));
                    trigger_loop_timer(); // for low power wakeup
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_WAIT_SHORT_PRESS\r\n");
                    s_tState = MAIN_APP_WAIT_SHORT_PRESS;
                }
                break;
            case MAIN_APP_WAIT_SHORT_PRESS:
                if (setting_timer_fired()) {
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_SHOW_EXAMPLE;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_SHOW_EXAMPLE\r\n");
                    break;
                }
                if (key_value == KEY_PRESSED_SHORT) {
                    setting_timer_stop();
                    if (set_mins == 0) {
                        trigger_loop_timer(); // for low power wakeup
                        s_tState = MAIN_APP_SHOW_EXAMPLE;
                        NRF_LOG_RAW_INFO("jump to MAIN_APP_SHOW_EXAMPLE\r\n");
                    } else {
                        start_time = get_time();
                        elapsed_time = 0;
                        last_time = start_time;
                        s_tState = MAIN_APP_UPDATE_PROGRESS;
                        NRF_LOG_RAW_INFO("jump to MAIN_APP_UPDATE_PROGRESS\r\n");
                    }
                }
                if (rotary_state == ROTARY_STATE_CLOCKWISE) {
                    set_mins += TIME_CHANGE_STEP;
                    update_settings_screen(set_mins);
                    setting_timer_restart(APP_TIMER_TICKS(SETTING_TIMER_TIMEOUT));
                } else if (rotary_state == ROTARY_STATE_COUNTERCLOCKWISE) {
                    if (set_mins > 0 && (set_mins - TIME_CHANGE_STEP) >= 0) {
                        set_mins -= TIME_CHANGE_STEP;
                    } else if (set_mins > 0) {
                        set_mins = 0;
                    }
                    update_settings_screen(set_mins);
                    setting_timer_restart(APP_TIMER_TICKS(SETTING_TIMER_TIMEOUT));
                }
                break;
            case MAIN_APP_SHOW_EXAMPLE:
                if (show_progress_hm_time_with_power_down(90, 90) == fsm_rt_cpl) {
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_START;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_START\r\n");
                }
                break;
            case MAIN_APP_CHECK_TIME:
                cur_time = get_time();
                if (cur_time - last_time >= 60) {
                    last_time = cur_time;
                    elapsed_time = cur_time - start_time;
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_UPDATE_PROGRESS;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_UPDATE_PROGRESS\r\n");
                }
                if (key_value == KEY_PRESSED_LONG) {
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_RESET_AND_SET_TIME;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_RESET_AND_SET_TIME\r\n");
                }
                if (key_value == KEY_PRESSED_SHORT) {
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_START;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_START\r\n");
                }
                break;
            case MAIN_APP_UPDATE_PROGRESS:
                if (show_progress_hm_time_with_power_down(elapsed_time/60, set_mins) == fsm_rt_cpl) {
                    trigger_loop_timer(); // for low power wakeup
                    s_tState = MAIN_APP_CHECK_TIME;
                    NRF_LOG_RAW_INFO("jump to MAIN_APP_CHECK_TIME\r\n");
                }
                break;
            default: break;
        }

#if defined(ENABLE_DEBUG_PIN)
//        DEBUG_POINT_B(); // to see the system duty cycle
#endif
    }
}


